# -*- coding: utf-8 -*-
"""Копія записника "Факторизація чисел (список простих дільників).ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1QBCAv1KvQJkgIOn039M-1lO54K9GPf7v

tlysenko@pu.org.ua

Задача. Увести ціле число, піднести його до квадрату, вивести отриманий результат.
"""

print('Hello')
x = int(input('x='))
print(x**2)

"""Задача 1. Згенерувати і вивести список простих чисел з указаного діапазону."""

x = int(input('Уведіть початок діапазона: '))
y = int(input('Уведіть кінець діапазона: '))
if x==1 or x==2:
    sp=[2]
    x=3
else: sp=[]
if x%2==0: x+=1 
if y%2!=0: y+=1 
for n in range(x,y,2):
    k=2
    for d in range(3,int(n**0.5)+1, 2):
        if n%d==0:
            k+=1
            break
    if k==2:
        sp.append(n)
print(sp)

"""Задача 2. Реалізувати алгоритм факторизації натурального числа: Взяти перше просте число зі списку простих чисел як перший дільник. Поки число, яке потрібно факторизувати, більше за 1: якщо число ділиться без остачі на дільник, то додати дільник до списку дільників і замінити число на частку від ділення числа на дільник, інакше взяти наступний дільник зі списку простих чисел."""

n=y=int(input('Уведіть число: '))
sp = [2]
if y%2!=0: y+=1 
for l in range(3,y,2):
    k=2
    for d in range(3,int(l**0.5)+1, 2):
        if l%d==0:
            k+=1
            break
    if k==2:
        sp.append(l)
d = []
i=0
while n>1:
    if n%sp[i]==0:
        n=n//sp[i]
        d.append(sp[i])
    else: 
        i+=1
print(d)

"""Задача 3. Факторизувати натуральне число та вказати кількість входжень кожного з простих множників до добутку. 
Наприклад, для числа 3267 вивести: 3 ^ 3 * 11 ^ 2
"""

from itertools import groupby
n=y=int(input('Уведіть число: '))
sp = [2]
if y%2!=0: y+=1 
for l in range(3,y,2):
    k=2
    for d in range(3,int(l**0.5)+1, 2):
        if l%d==0:
            k+=1
            break
    if k==2:
        sp.append(l)
d = []
i=0
while n>1:
    if n%sp[i]==0:
        n=n//sp[i]
        d.append(sp[i])
    else: 
        i+=1
res=[]
for a in d:
    count=0
    for b in d:
        if a==b:count+=1
    if count!=1:res.append(str(a)+" ^ "+str(count))
    else: res.append(str(a))
res=[el for el, _ in groupby(res)]
res=" * ".join(res)
print(res)